package java;/*
 * 4. 구구단 2~9단을 세로 방향으로 출력하는 프로그램
 *
 * <예시> [2단] [3단] [4단] ... [9단]
 * 2*1=2 3*1=3 ...
 * 2*2=4
 * ...
 * 2*9=18 3*9=27 ...
 *
 * 예시처럼 열 방향으로 진행된다.
 */

public class JavaTask4 {

    public static void main(String[] ar) {

        // [2단] [3단] ... 제목부분 출력
        for (int n = 2; n < 10; n++) {
            System.out.print("[" + n + "단]\t"); // ⚠️ 들여쓰기(Tab)= \t 세로 출력은 print()
        }
        System.out.println(); // 띄어쓰기는 println()

        // 구구단 순서대로
        for (int i = 1; i < 10; i++) {
            for (int j = 2; j < 10; j++) {
                System.out.print(j + "*" + i + "=" + (j * i) + "\t");
            }

            System.out.println();
        }

        System.out.println();
        main2(ar);
    }

    // 오답: 헷갈릴 수 있는 코드 - 구구단이 별모양(삼각형) 형태로 출력되는 프로그램
    public static void main2(String[] ar) {

        // 여기까진 동일
        for (int n = 2; n < 10; n++) {
            System.out.print("[" + n + "단]\t");
        }
        System.out.println();


        // 오류: 2*2, 3*1, 4*1, 4*2,... 가 출력되지 않는 형태의 ◤ 출력
        for (int i = 1; i < 10; i++) {
            for (int j = i+1; j < 10; j++) {
                System.out.print(j + "*" + i + "=" + (j * i) + "\t");
            }

            System.out.println();
        }
        main3(ar);

    }

    // 오답: 헷갈릴 수 있는 코드 - 구구단이 별모양(삼각형) 형태로 출력되는 프로그램2
    public static void main3(String[] ar) {

        // 여기까진 동일
        for (int n = 2; n < 10; n++) {
            System.out.print("[" + n + "단]\t");
        }
        System.out.println();

        // 오류: 2*2, 3*1, 4*1, 4*2,... 가 출력되지 않는 형태의 ◥ 출력
        for (int i = 1; i <= 9; i++) {
            for (int space = 2; space < i + 1; space++) {
                System.out.print("\t");
            }
            for (int j = i + 1; j <= 9; j++) {
                System.out.print(j + "*" + i + "=" + (j * i) + "\t");
            }
            System.out.println();
        }

    }
}

/*
 * *출력 내용*
 * 옳은 경우 kotlin.kotlin.main()
[2단]	[3단]	[4단]	[5단]	[6단]	[7단]	[8단]	[9단]
2*1=2	3*1=3	4*1=4	5*1=5	6*1=6	7*1=7	8*1=8	9*1=9
2*2=4	3*2=6	4*2=8	5*2=10	6*2=12	7*2=14	8*2=16	9*2=18
2*3=6	3*3=9	4*3=12	5*3=15	6*3=18	7*3=21	8*3=24	9*3=27
2*4=8	3*4=12	4*4=16	5*4=20	6*4=24	7*4=28	8*4=32	9*4=36
2*5=10	3*5=15	4*5=20	5*5=25	6*5=30	7*5=35	8*5=40	9*5=45
2*6=12	3*6=18	4*6=24	5*6=30	6*6=36	7*6=42	8*6=48	9*6=54
2*7=14	3*7=21	4*7=28	5*7=35	6*7=42	7*7=49	8*7=56	9*7=63
2*8=16	3*8=24	4*8=32	5*8=40	6*8=48	7*8=56	8*8=64	9*8=72
2*9=18	3*9=27	4*9=36	5*9=45	6*9=54	7*9=63	8*9=72	9*9=81

틀린 경우 kotlin.main2() : ◤ 삼각형 형태로 출력
[2단]	[3단]	[4단]	[5단]	[6단]	[7단]	[8단]	[9단]
2*1=2	3*1=3	4*1=4	5*1=5	6*1=6	7*1=7	8*1=8	9*1=9
3*2=6	4*2=8	5*2=10	6*2=12	7*2=14	8*2=16	9*2=18
4*3=12	5*3=15	6*3=18	7*3=21	8*3=24	9*3=27
5*4=20	6*4=24	7*4=28	8*4=32	9*4=36
6*5=30	7*5=35	8*5=40	9*5=45
7*6=42	8*6=48	9*6=54
8*7=56	9*7=63
9*8=72

틀린 경우 main3() : ◥ 삼각형 형태로 출력
[2단]	[3단]	[4단]	[5단]	[6단]	[7단]	[8단]	[9단]
2*1=2	3*1=3	4*1=4	5*1=5	6*1=6	7*1=7	8*1=8	9*1=9
		3*2=6	4*2=8	5*2=10	6*2=12	7*2=14	8*2=16	9*2=18
				4*3=12	5*3=15	6*3=18	7*3=21	8*3=24	9*3=27
						5*4=20	6*4=24	7*4=28	8*4=32	9*4=36
								6*5=30	7*5=35	8*5=40	9*5=45
										7*6=42	8*6=48	9*6=54
												8*7=56	9*7=63
														9*8=72

 *
 */